<a href="https://colab.research.google.com/github/jirvingphd/fsds_pt_100719_cohort_notes/blob/master/section_09_SQL_PT_correct.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# SECTION 09: SQL DATABASES

## LEARNING OBJECTIVES:

- Understand what a database is and how it is different than a DataFrame/Excel sheet.
- Understand how to read database map
    - Primary keys vs forgein keys
- Understand how to select, filter, order, and group data using SQL
- Understand the different types of Joins

- Survive on sql-island:
    - https://sql-island.informatik.uni-kl.de/

# SQL Databases


SQL is designed to work with **relational data**. This really just means pieces of data that are **related to eachother**. In the example above, data on the `employees` table has some relationship to data on the `offices` table.

Each table has a **primary key** (like a DataFrame index), with a unique index for each row in the database. The name of the primary key is preceded by an asterix (\*). 

Columns that are the **primary key one on table** can also appear on **other tables**. Then it is refered to as a **foreign key** aka the primary key from a different ("foreign") table.

<img src="https://raw.githubusercontent.com/learn-co-students/dsc-sql-introduction-online-ds-sp-000/master/images/Database-Schema.png">

### ⨠ Q: Why do we need databases? Why can't we just use a bunch of Pandas DataFrames?
- Efficient/compact arragement of data that minimzes redundancy.

## Querying Databases - `SELECT`ing data



- NOTE: SQL queries dot not _have_ to be all-caps, but it is a convention to help differentiate sql syntax versus names of tables/columns.

To retrieve data from one or more tables you usually use a `SELECT` statement. 

```
SELECT col1, col2, col3
FROM table
WHERE records match criteria
LIMIT 100;
```

Another similar query to preview all of the columns from the first 5 rows of a table would look like this:  

```SQL
SELECT *
FROM table
LIMIT 5;
```

Notice how all of these statements:
1.  **start with the `SELECT`**
2. followed by **what you want to select**. Separate multiple column names separated by a `,` 
3. Then specify where the data is coming `FROM` followed by the table name. 
4. **Afterward, you can provide conditions such as filters or sorting**. To demonstrate, here's a more complex example where you could preview the 10 most expensive payments received.

```SQL
SELECT *
FROM payments
ORDER BY amount DESC
LIMIT 10;
```

## SQL with `sqlite3`

- Use `sqlite3` for SQL queries in Python.
    1. Connect to database
    2. Create a cursor.
    3. Form your query
    4. Execute/fetch your results.

```python
import sqlite3
connection = sqlite3.connect('pet_database.db') # Creates pet_database, but empty until create a table    
cursor = connection.cursor()


# Select from table
cursor.execute('''SELECT name FROM cats;''').fetchall()

```

In [0]:
!pip install -U fsds_100719
from fsds_100719.imports import *

fsds_1007219  v0.4.34 loaded.  Read the docs: https://fsds.readthedocs.io/en/latest/

In [0]:
from google.colab import drive
drive.mount('/content/drive')
db = '/content/drive/My Drive/Datasets/data.sqlite'

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

In [0]:
import sqlite3
# connect to database
conn = sqlite3.connect(db)
cur = conn.cursor()

In [0]:
# Get table names
table_names = cur.execute("""
SELECT name 
FROM sqlite_master 
WHERE type='table';
""").fetchall()
table_names

[('orderdetails',),
 ('payments',),
 ('offices',),
 ('customers',),
 ('orders',),
 ('productlines',),
 ('products',),
 ('employees',)]

In [0]:
names = [print(x[0]) for x in table_names];
names

orderdetails
payments
offices
customers
orders
productlines
products
employees

[None, None, None, None, None, None, None, None]

In [0]:
table_names = [x[0] for x in table_names]
table_names

['orderdetails',
 'payments',
 'offices',
 'customers',
 'orders',
 'productlines',
 'products',
 'employees']

<img src="https://raw.githubusercontent.com/learn-co-students/dsc-sql-introduction-online-ds-sp-000/master/images/Database-Schema.png" width=500>

In [0]:

df = pd.DataFrame(cur.execute("select * from products").fetchall())
df

             0                                      1  ...      7       8
0     S10_1678  1969 Harley Davidson Ultimate Chopper  ...  48.81   95.70
1     S10_1949               1952 Alpine Renault 1300  ...  98.58  214.30
2     S10_2016                  1996 Moto Guzzi 1100i  ...  68.99  118.94
3     S10_4698   2003 Harley-Davidson Eagle Drag Bike  ...  91.02  193.66
4     S10_4757                    1972 Alfa Romeo GTA  ...  85.68  136.00
..         ...                                    ...  ...    ...     ...
105  S700_3505                            The Titanic  ...  51.09  100.17
106  S700_3962                         The Queen Mary  ...  53.63   99.31
107  S700_4002              American Airlines: MD-11S  ...  36.27   74.03
108   S72_1253                       Boeing X-32A JSF  ...  32.77   49.66
109   S72_3212                             Pont Yacht  ...  33.30   54.60

[110 rows x 9 columns]

In [0]:
cur.description

(('productCode', None, None, None, None, None, None),
 ('productName', None, None, None, None, None, None),
 ('productLine', None, None, None, None, None, None),
 ('productScale', None, None, None, None, None, None),
 ('productVendor', None, None, None, None, None, None),
 ('productDescription', None, None, None, None, None, None),
 ('quantityInStock', None, None, None, None, None, None),
 ('buyPrice', None, None, None, None, None, None),
 ('MSRP', None, None, None, None, None, None))

In [0]:
col_names =[col[0] for col in cur.description]
print(col_names)

df = pd.DataFrame(cur.fetchall(),
                  columns=col_names)
df.head()

['productCode', 'productName', 'productLine', 'productScale', 'productVendor', 'productDescription', 'quantityInStock', 'buyPrice', 'MSRP']

  productCode                            productName  ... buyPrice    MSRP
0    S10_1678  1969 Harley Davidson Ultimate Chopper  ...    48.81   95.70
1    S10_1949               1952 Alpine Renault 1300  ...    98.58  214.30
2    S10_2016                  1996 Moto Guzzi 1100i  ...    68.99  118.94
3    S10_4698   2003 Harley-Davidson Eagle Drag Bike  ...    91.02  193.66
4    S10_4757                    1972 Alfa Romeo GTA  ...    85.68  136.00

[5 rows x 9 columns]

## FILTERING AND ORDERING

- `ORDER BY` - `DESC`/`ASC`
- `LIMIT`
- `BETWEEN`
- `NULL`
- `COUNT`
- `GROUP BY`

In [0]:
query = """select * from products
GROUP BY productLine 
ORDER BY quantityInStock DESC;"""
data = cur.execute(query).fetchall()
col_names =[col[0] for col in cur.description]
df = pd.DataFrame(data,
                  columns=col_names)
df

  productCode                       productName  ... buyPrice    MSRP
0    S50_1341      1930 Buick Marquette Phaeton  ...    27.06   43.64
1   S700_2824                   1982 Camaro Z28  ...    46.53  101.15
2    S50_4713                2002 Yamaha YZR M1  ...    34.17   81.36
3    S72_1253                  Boeing X-32A JSF  ...    32.77   49.66
4    S72_3212                        Pont Yacht  ...    33.30   54.60
5    S50_1514    1962 City of Detroit Streetcar  ...    37.49   58.58
6    S50_1392  Diamond T620 Semi-Skirted Tanker  ...    68.29  115.75

[7 rows x 9 columns]

## GROUPING DATA WITH SQL

- Like we do with Pandas, we can use GROUP BY statements in SQL and then apply **aggregate functions:**
    - `COUNT`
    - `MAX`
    - `MIN`
    - `SUM`
    - `AVG`

In [0]:
cur.execute("""SELECT city, COUNT(employeeNumber)
FROM offices 
JOIN employees
USING(officeCode)
GROUP BY city
ORDER BY count(employeeNumber) DESC;""")

df = pd.DataFrame(cur.fetchall())

df.columns = [x[0] for x in cur.description]

df.head()

            city  COUNT(employeeNumber)
0  San Francisco                      6
1          Paris                      5
2         Sydney                      4
3         Boston                      2
4         London                      2

## ALIASING

- can assign a temporary name to data being imported
- Useful for `JOIN`,`GROUP BY`, and aggregates.

In [0]:
cur.execute("""SELECT city, COUNT(employeeNumber) AS numEmployees
               FROM offices
               JOIN employees
               USING(officeCode)
               GROUP BY 1
               ORDER BY numEmployees DESC;""")
df = pd.DataFrame(cur.fetchall())
df.columns = [x[0] for x in cur.description]
df.head()

            city  numEmployees
0  San Francisco             6
1          Paris             5
2         Sydney             4
3         Boston             2
4         London             2

In [0]:
cur.execute("""SELECT customerName,
               COUNT(customerName) AS number_purchases,
               MIN(amount) AS min_purchase,
               MAX(amount) AS max_purchase,
               AVG(amount) AS avg_purchase,
               SUM(amount) AS total_spent
               FROM customers
               JOIN payments
               USING(customerNumber)
               GROUP BY 1
               ORDER BY SUM(amount) DESC;""")
df = pd.DataFrame(cur.fetchall())
df. columns = [i[0] for i in cur.description]
print(len(df))
df.head()

98

                   customerName  number_purchases  ...  avg_purchase total_spent
0        Euro+ Shopping Channel                13  ...  55056.844615   715738.98
1  Mini Gifts Distributors Ltd.                 9  ...  64909.804444   584188.24
2    Australian Collectors, Co.                 4  ...  45146.267500   180585.07
3            Muscle Machine Inc                 4  ...  44478.487500   177913.95
4       Dragon Souveniers, Ltd.                 4  ...  39062.757500   156251.03

[5 rows x 6 columns]

## The `WHERE` Clause

In general, the `WHERE` clause filters query results by some condition. As you are starting to see, you can also combine multiple conditions.

- 
```python
cur.execute("""SELECT * FROM customers WHERE city = 'Boston' OR city = 'Madrid';""")
df = pd.DataFrame(cur.fetchall())
df.columns = [x[0] for x in cur.description]
df
```


Two additional keywords that you can use to refine your searches are the `ORDER BY` and `LIMIT` clauses. The order by clause allows you to sort the results by a particular feature. For example, you could sort by the `customerName` column if you wished to get results in alphabetical order. By default, `ORDER BY` is ascending. So, as with the above example, if you want the opposite, use the additional parameter `DESC`. Finally, the limit clause is typically the last argument in a SQL query and simply limits the output to a set number of results.

In [0]:
cur.execute("""SELECT * FROM customers WHERE city = 'Boston' OR city = 'Madrid';""")
df = pd.DataFrame(cur.fetchall())
df.columns = [x[0] for x in cur.description]
df

  customerNumber                customerName  ... salesRepEmployeeNumber creditLimit
0            141      Euro+ Shopping Channel  ...                   1370   227600.00
1            237               ANG Resellers  ...                               0.00
2            344                 CAF Imports  ...                   1702    59600.00
3            362           Gifts4AllAges.com  ...                   1216    41900.00
4            458  Corrida Auto Replicas, Ltd  ...                   1702   104600.00
5            465         Anton Designs, Ltd.  ...                               0.00
6            495        Diecast Collectables  ...                   1188    85100.00

[7 rows x 13 columns]

## The `HAVING` clause

 The `HAVING` clause works similarly to the `WHERE` clause, except it is used to filter data selections on conditions **after** the `GROUP BY` clause.

In [0]:
cur.execute("""SELECT city, COUNT(customerNumber) AS number_customers
               FROM customers
               GROUP BY 1
               HAVING COUNT(customerNumber)>=5;""")
df = pd.DataFrame(cur.fetchall())
df. columns = [i[0] for i in cur.description]
print(len(df))
df.head()

2

     city  number_customers
0  Madrid                 5
1     NYC                 5

## Combining `WHERE` and `HAVING`

We can also use the `WHERE` and `HAVING` clauses in conjunction with each other for more complex rules.

- For example, let's say we want a list of customers who have made at least 3 purchases of over 50K each.

In [0]:
cur.execute("""SELECT customerName,
               COUNT(amount) AS number_purchases_over_50K
               FROM customers
               JOIN payments
               USING(customerNumber)
               WHERE amount >= 50000
               GROUP BY 1
               HAVING count(amount) >= 3
               ORDER BY count(amount) DESC;""")
df = pd.DataFrame(cur.fetchall())
df. columns = [i[0] for i in cur.description]
print(len(df))
df.head()

53

                   customerName  number_purchases_over_50K
0        Euro+ Shopping Channel                         13
1  Mini Gifts Distributors Ltd.                          9
2       Anna's Decorations, Ltd                          4
3    Australian Collectors, Co.                          4
4            Baane Mini Imports                          4

## `JOIN` STATEMENTS

<img src="https://raw.githubusercontent.com/learn-co-students/dsc-sql-introduction-online-ds-sp-000/master/images/Database-Schema.png">

### Task: Displaying product details along with order details

Let's say you need to generate some report that includes details about products from orders. To do that, we would need to take data from multiple tables in a single statement.

In [0]:
# import sqlite3
# import pandas as pd
# conn = sqlite3.connect('/content/drive/My Drive/Datasets/data.sqlite')
# cur = conn.cursor()

In [0]:
cur.execute("""SELECT * 
               FROM orderdetails
               JOIN products
               ON orderdetails.productCode = products.productCode
               LIMIT 10;
               """)
df = pd.DataFrame(cur.fetchall()) #Take results and create dataframe
df.columns = [i[0] for i in cur.description]
df.head()

  orderNumber productCode quantityOrdered  ... quantityInStock buyPrice    MSRP
0       10100    S18_1749              30  ...            2724    86.70  170.00
1       10100    S18_2248              50  ...             540    33.30   60.54
2       10100    S18_4409              22  ...            6553    43.26   92.03
3       10100    S24_3969              49  ...            2081    21.75   41.03
4       10101    S18_2325              25  ...            9354    58.48  127.13

[5 rows x 14 columns]

## The `USING` clause

A more concise way to join the tables, if the column name is identical, is the `USING` clause. Rather then saying on `tableA.column = tableB.column` we can simply say `using(column)`. Again, this only works if the column is **identically named** for both tables.

## TYPES OF JOINS

- Joins may be:
    - INNER (default)
    - OUTER
    - LEFT 
    - RIGHT

<img src="https://raw.githubusercontent.com/learn-co-students/dsc-join-statements-online-ds-sp-000/master/images/venn.png">

## Primary vs Foreign Keys
- primary key:
- forgein key:

### One-to-One, One-to-many, many-to-many Joins

## SQL Subqueries

```python
cur.execute("""SELECT lastName, firstName, officeCode
               FROM employees
               WHERE officeCode IN (SELECT officeCode
                                    FROM offices 
                                    WHERE country = "USA");
                                    """)
df = pd.DataFrame(cur.fetchall())
df.columns = [x[0] for x in cur.description]
df
```

## SQL WITH PANDAS

### Using `.query()`

Pandas DataFrames come with a built-in query method, which allows you to get information from DataFrames quickly without using the cumbersome slicing syntax.  

See the following examples:

```python
# Getting Data using slicing syntax
foo_df = bar_df[bar_df[bar_df['Col_1'] > bar_df['Col_2']]]

# Using The query method
foo_df = bar_df.query("Col_1 > Col_2")

# These two lines are equivalent!
```

Note that if you want to use `and` and `or` statements with the `.query()` method, you'll need to use `"&"` and `"|"` instead.

```python
foo_df = bar_df.query("Col_1 > Col_2 & Col_2 <= Col_3")
```

## Using SQL with Pandas

- Pandas DataFrames have a method called `.query()`
- This allows us to use SQL-like commands to reference data.
```python
## Normal Pandas Syntax
foo_df = bar_df.loc[bar_df['Col_1']>bar_df['Col_2']]
```

```python
## Using .query()
foo_df = bar_df.query("Col_1 > Col_2")
```
- How to use:
    - Enter the querty as a single string, using just column names to reference data.
    - To use and/or statements, use `&` and `|`, respectively

```python
foo_df = bar_df.query("Col_1 > Col_2 & Col_2 <= Col_3")
```

## Using SQL syntax with `pandasql`


Since SQL is such a powerful, comfortable tool for Data Scientists, some people had the bright idea of creating a library that lets users query DataFrames using SQL-style syntax.  This library is called [pandasql](https://pypi.org/project/pandasql/).

We can install `pandasql` using the bash command `pip install pandasql`.

### Importing pandasql

In order to use `pandasql`, we need to start by importing a `sqldf` object from `pandasql`

```python
from pandasql import sqldf
pysqldf = lambda q: sqldf(q, globals())
```

### Writing Queries
```python
q = """SELECT
        m.date, m.beef, b.births
     FROM
        meats m
     INNER JOIN
        births b
           ON m.date = b.date;"""

results = pysqldf(q)

```

## SQL Data Types
- Data types in SQLite3:
    - https://www.sqlite.org/datatype3.html
    
- Data types:
    - TEXT
    - INTEGER
    - REAL
    - BLOB
    - NULL


Since SQL is such a powerful, comfortable tool for Data Scientists, some people had the bright idea of creating a library that lets users query DataFrames using SQL-style syntax.  This library is called [pandasql](https://pypi.org/project/pandasql/).

We can install `pandasql` using the bash command `pip install pandasql`.

#### Importing pandasql

In order to use `pandasql`, we need to start by importing a `sqldf` object from `pandasql`

```python
from pandasql import sqldf
```


Next, it's helpful to write a lambda function that will make it quicker and easier to write queries.  Normally, you would have to pass in the global variables every time we use an object.  In order to avoid doing this every time, here's how to write a lambda that does this for you:

```python
pysqldf = lambda q: sqldf(q, globals())
```

#### Writing Queries

To write a query, you just format it as a multi-line string!

```python
q = """SELECT
        m.date, m.beef, b.births
     FROM
        meats m
     INNER JOIN
        births b
           ON m.date = b.date;"""
```

In order to query DataFrames, you can just pass in the query string you've created to our `sqldf` object that you stored in `pysqldf`.  This will return a DataFrame.  

```python
results = pysqldf(q)
```



## SQL Data Types
- Data types in SQLite3:
    - https://www.sqlite.org/datatype3.html
    
- Data types:
    - TEXT
    - INTEGER
    - REAL
    - BLOB
    - NULL

## DATABASE ADMIN 101

In [0]:
db = '/content/drive/My Drive/Datasets/pets_database.db'
import sqlite3
conn = sqlite3.connect(db)
cur = conn.cursor()

In [0]:
cur.execute("""CREATE TABLE cats (
    id INTEGER PRIMARY KEY,
    name TEXT,
    age INTEGER,
    breed TEXT)
    """)

In [0]:
# insert Maru into the pet_database.db here
cur.execute('''INSERT INTO cats (name, age, breed) 
                  VALUES ('Maru', 3, 'Scottish Fold');
            ''')